Merge pull request #1 from ThienNguyen666/feature/refactor-orkes-cloud
Feature/refactor orkes cloud
